//package my_Project_For_Github;
//
//import java.util.Scanner;
//public static void main(String[]args){
//
//
////6. Создать массив, вывести все четные числа, но если встретиться число 237 - остановить вывод
//        System.out.println("Введите длину массива: ");
//        Scanner in=new Scanner(System.in);
//        int size=in.nextInt();
//        int[]num1=new int[size];
//
//        System.out.println("Введите элементы массива: ");
//
//
//        for(int i=0;i<size;i++){
//        num1[i]=in.nextInt();
//        }
//        System.out.println("Четные элементы: ");
//        for(int i=0;i<num1.length;i++){
//        if((num1[i]!=237)&&(num1[i]%2==0)){
//        System.out.println(num1[i]);
//        }
//        }
//
//        }